import React from 'react'
import './SourceNoteDiv.scss'

export default class SourceNoteDiv extends React.Component {
  render () {
    return (
      <div className="listItem">
        <ul>
          <li>
            <div className="noteDiv">
              <h2 className="sourceName">我的祖国</h2>
              <div className="noteHeader">
                <img
                  src="//q1.qlogo.cn/g?b=qq&amp;k=69ZiaGbnRyupQTrvoWfRnsA&amp;s=40&amp;t=1510934400"
                  alt="头像" width="36" height="36"/>
                <span className="sender">阿拉斯加上课</span> <span className="time">2018-09-09</span>
              </div>
              <div className="textOut">
                <div className="text">
                  <p>时间匆匆逝过，怎耐谁也无法挽留秋风的脚步。已是“无边落木萧萧下，不尽长江滚滚来”在这个深秋，在这个令人深思而迷惘的季节，不禁使我想起柳永的《雨霖铃》中说的“多情自古伤离别，更那堪冷清秋节。”就连才华横溢的李煜，也只留下了“春花秋月何时了，往事知多少”的感慨。确实“自古逢秋悲寂寥”多少文人墨客抒写壮丽诗篇，多少名人事迹留下千古佳话。
                    秋，带着落叶的声音来了，漫漫深秋的灵韵，夹进了我的记忆之中，让我思绪飞扬。枯叶飘零，像一首悲凉的诗，细雨如愁似花针般的缠绵，枫叶飘零着，极目远眺，那远处是一片麦黄，硕果累累也结满了思念。看，天边又划过一道美丽的弧线，哪儿记得“何处秋风至，萧萧送雁群。”山抹微云，天粘衰草，几度寒风萧瑟，洪波涌起。在密密的围从中，树树秋声，山山寒色，秋天西风作，多肃杀之声，俯首遥看，草木摇落露为霜。


                    “蒹葭苍苍，白露为霜”大凡每到这个时候，我都会不禁吟诵起这首清丽的诗，秋天的菊花在花丛中姗姗来迟，那柔美的花影在所有的花朵凋谢之中，显得格外娇媚。雨，还是淅淅沥沥的下着，乘着一叶扁舟，带着淡淡的哀愁划桨于江面之上，远方天际烟雨蒙蒙如的如画，两岸甘霖硕果累累，散发出诱人的橘香。站立于船头，舒展着筋骨，秋风吹皱了一池的江水，在我的心灵激起阵阵涟漪，枫叶们不停的挥舞着，飘荡在天地之间，看透世间一切生与死，爱与恨的希望释放在音乐中，在无尽的舞蹈中。听见放吹过耳畔的飒飒风声，像一首渐行渐远等离恨歌。哀伤凝聚在心头，冷风吹不散，在梦中飘逸的飞花，如此轻盈是超脱世俗的美。天水之间，全是清明，朗朗乾坤，不禁感叹“自在飞花轻似梦，无边丝雨细如愁”啊。我深深地吸一口气，湿润的空气中带着浓郁的桂花香，飘送在那迷人的深秋之际。我拾起一片枫叶，注目凝望，又陷入深深的沉思，任凭“花自飘零水自流”。
                    “空山新雨后，天气晚来秋”随之，一阵凉风习习，扑面而来。所有凝聚在心头的惆怅与孤独，在这个深秋，随着落叶一片片翻飞，深深地埋藏在心底，扎根于天地之间。那片丛林中，想想已是“雨径绿芜合，霜园红叶多”。
                    秋雨的陪伴，淋湿了我的心事，抚平了我的心绪。秋枫，注定了我一世的忧伤，一世的痴狂，唯有秋日里把心深深埋藏，压抑着内心的悲愁。默叹着，时光亦悄然而逝。
                    秋雨的陪伴，淋湿了我的心事，抚平了我的心绪。秋枫，注定了我一世的忧伤，一世的痴狂，唯有秋日里把心深深埋藏，压抑着内心的悲愁。默叹着，时光亦悄然而逝。哈哈哈哈哈哈


                  </p>
                </div>
              </div>
            </div>
          </li>
          <li>
            <div className="noteDiv">
              <h2 className="sourceName">我的祖国</h2>
              <div className="noteHeader">
                <img
                  src="//q1.qlogo.cn/g?b=qq&amp;k=69ZiaGbnRyupQTrvoWfRnsA&amp;s=40&amp;t=1510934400"
                  alt="头像" width="36" height="36"/>
                <span className="sender">阿拉斯加上课</span> <span className="time">2018-09-09</span>
              </div>
              <div className="textOut">
                <div className="text">
                  <p>今天是祖国65岁的生日，我怀着满怀的好心情为祖国母亲感到衷心的高兴。但是你们知道吗今天的祖国虽然她有着那么多的辉煌事迹，但是她的成功却不是一帆顺风的而是多灾多难的。她也经历过失败也遭受过嘲讽，还曾历尽了无数的大风霜，她曾经还付出过许多鲜血。我们的祖国其实是面临过无穷无尽的黑暗，才会有了今天的辉煌历史。

                    我们不能忘记那些历史例如：华人和狗不能入内的路牌，1839年的悲惨鸦片战争、那1840年不平等的南京条约、那1860年可恶的英法联军火烧中国北京美丽的圆明园，帝国主义者为了将中国占为己有不惜一切手段。让中国陷入一场血雨腥风的战争之中，使老百姓生活在水深火热之中。当时所以人都认定中国将会面临灭亡，但是我们可爱的祖国并没有!她依然骄傲的抬起头微笑着。但是我们的人民并没有屈服，许许多多的爱国主义者站了出来，他们汇集在一起，成立了中国共产党。1921年7月23日，中国共产党诞生了!祖国的前方有了希望的曙光，祖国以她缓慢而坚定的脚步缓缓地向前走去。祖国缓缓地从灭亡的生死线上一步又一步的走向繁荣富强，尽管中间的过程非常的艰辛，但是她依然坚持了下来。从此中国共产党们开始了长达8年的抗日战争。

                    在这8年的抗战中，有着许许多多的英雄，王小二就是其中一位小英雄。在河北省沫源县出现了一位全国闻名的抗日小英雄，他的名字叫王二小。王二小牺牲时才七岁，在日本鬼子扫荡一条山沟的时候，为了掩护几千名老乡和干部，他不顾自己的生命危险，把敌人带进了八路军的埋伏圈。气急败坏的日本鬼子把王二小挑在枪尖摔死在大石头的上面。干部和老乡脱离了危险，小英雄王二小英勇牺牲了。王二小的动人事迹很快传遍了解放区，每一个老乡都含着眼泪，歌唱二小放牛郎，《晋察冀日报》在头版报道了王二小的英勇事迹。晋察冀边区的文艺战土方冰和劫夫很快创作了后来传唱全中国的着名儿童歌曲《歌唱二小放牛郎》。

                    终于经过了28年的艰苦奋斗，我们的祖国终于迎来了新中国的诞生。1949年10月1日下午3时，30万群众聚集在天安门广场，举行了开国大典。毛泽东主席在天安门城楼上亲自按动电钮，升起了第一面五星红旗。他向全世界庄严宣告：中华人民共和国中央人民政府成立了!中国人民从此站起来了!从那时起我们站起来了，我们开始申办奥运会，我们的奥运健儿开始夺冠，我们的祖国开始强盛起来，我们加入了WTO，我们开始举办世博会，我们开始自己生产日用品，我们开始迈向小康……现在我们青少年生活在蜜罐温床里，我们应该更加努力学习，争当好学生，人小志不小，树立远大理想，长大后报效我们伟大的祖国母亲，不辜负祖国对我们的期望。这个国庆我还想了许多许多……

                  </p>
                </div>
              </div>
            </div>
          </li>
        </ul>
      </div>
    )
  }
}